Revit 2024 API
TransmissionData Constructor
 Constructs a TransmissionData from another TransmissionData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public TransmissionData(
	TransmissionData other
)
Visual Basic
Public Sub New ( _
	other As TransmissionData _
)
Visual C++
public:
TransmissionData(
	TransmissionData^ other
)
Parameters
other
Type: Autodesk.Revit.DB.TransmissionData
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TransmissionData Class
Autodesk.Revit.DB Namespace